201_3dDamBreak/002_3dDamBreak_inerIsoFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

//xmin 0;
//test 3.22;
//xmax  #calc "1.0*$test";

vertices
(
    (0 -0.5 0)     //0
    (3.22 -0.5 0)  //1
    (3.22 0.5 0)   //2
    (0 0.5 0)      //3
    (0 -0.5 1)     //4
    (3.22 -0.5 1)  //5
    (3.22 0.5 1)   //6
    (0 0.5 1)      //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 18 18) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    minX
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    maxX
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    minY
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    maxY
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    minZ
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    maxZ
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
