201_3dDamBreak/002_3dDamBreak_inerIsoFoam/system/surfaceFeatureExtractDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

walls_mm_tr.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        includedAngle   150;
    }

    subsetFeatures
    {
        nonManifoldEdges    no;

        openEdges           yes;
    }

    writeObj                yes;
}
